jankaluza/qsimkit/CPU/Variants/msp430xW42x.cpp
#ifndef __FLT_DENORM_MIN__
#define __FLT_DENORM_MIN__ 1.40129846e-45F
#endif
#ifndef P5IN_
#define P5IN_ 0x0030
#endif
#ifndef SCFQ_128K
#define SCFQ_128K 0x03
#endif
#ifndef SIFDACR0_
#define SIFDACR0_ 0x01C0
#endif
#ifndef __CHAR32_TYPE__
#define __CHAR32_TYPE__ unsigned int
#endif
#ifndef __msp430_headers_lcd_h
#define __msp430_headers_lcd_h 
#endif
#ifndef __FLT_MAX__
#define __FLT_MAX__ 3.40282347e+38F
#endif
#ifndef SIFDACR1_
#define SIFDACR1_ 0x01C2
#endif
#ifndef SIFDACR2_
#define SIFDACR2_ 0x01C4
#endif
#ifndef SIFDACR3_
#define SIFDACR3_ 0x01C6
#endif
#ifndef TAIV_
#define TAIV_ TA0IV_
#endif
#ifndef SIFDACR4_
#define SIFDACR4_ 0x01C8
#endif
#ifndef __SIZEOF_DOUBLE__
#define __SIZEOF_DOUBLE__ 4
#endif
#ifndef SIFDACR5_
#define SIFDACR5_ 0x01CA
#endif
#ifndef WDTHOLD
#define WDTHOLD 0x0080
#endif
#ifndef __INTMAX_TYPE__
#define __INTMAX_TYPE__ long long int
#endif
#ifndef SIFDACR6_
#define SIFDACR6_ 0x01CC
#endif
#ifndef __DEC128_MAX_EXP__
#define __DEC128_MAX_EXP__ 6145
#endif
#ifndef FLLD_1
#define FLLD_1 0
#endif
#ifndef __GNUC_MINOR__
#define __GNUC_MINOR__ 5
#endif
#ifndef __UINTMAX_MAX__
#define __UINTMAX_MAX__ 18446744073709551615ULL
#endif
#ifndef __DEC32_MANT_DIG__
#define __DEC32_MANT_DIG__ 7
#endif
#ifndef SIFTSM20_
#define SIFTSM20_ 0x01F8
#endif
#ifndef COMPARATORA_VECTOR
#define COMPARATORA_VECTOR 22
#endif
#ifndef SIFTSM21_
#define SIFTSM21_ 0x01FA
#endif
#ifndef __DBL_MAX_10_EXP__
#define __DBL_MAX_10_EXP__ 38
#endif
#ifndef __LDBL_DENORM_MIN__
#define __LDBL_DENORM_MIN__ 1.40129846e-45L
#endif
#ifndef SIFTSM22_
#define SIFTSM22_ 0x01FC
#endif
#ifndef SIFTSM23_
#define SIFTSM23_ 0x01FE
#endif
#ifndef TACCTL0_
#define TACCTL0_ TA0CCTL0_
#endif
#ifndef __STDC__
#define __STDC__ 1
#endif
#ifndef MC1
#define MC1 0x0020
#endif
#ifndef __PTRDIFF_TYPE__
#define __PTRDIFF_TYPE__ long int
#endif
#ifndef TAIV_OVERFLOW
#define TAIV_OVERFLOW 0x0A
#endif
#ifndef SCFQCTL_
#define SCFQCTL_ 0x0052
#endif
#ifndef P2IES_
#define P2IES_ 0x002C
#endif
#ifndef TACCTL2_
#define TACCTL2_ TA0CCTL2_
#endif
#ifndef DCOPLUS
#define DCOPLUS 0x80
#endif
#ifndef MSP430
#define MSP430 1
#endif
#ifndef __msp430_headers_compa_h
#define __msp430_headers_compa_h 
#endif
#ifndef P6DIR_
#define P6DIR_ 0x0036
#endif
#ifndef __DEC64_SUBNORMAL_MIN__
#define __DEC64_SUBNORMAL_MIN__ 0.000000000000001E-383DD
#endif
#ifndef __DEC128_MANT_DIG__
#define __DEC128_MANT_DIG__ 34
#endif
#ifndef __MSP430_CPU__
#define __MSP430_CPU__ 0
#endif
#ifndef __SIZEOF_LONG_LONG__
#define __SIZEOF_LONG_LONG__ 8
#endif
#ifndef FN_2
#define FN_2 0x04
#endif
#ifndef FN_3
#define FN_3 0x08
#endif
#ifndef FN_4
#define FN_4 0x10
#endif
#ifndef FN_8
#define FN_8 0x20
#endif
#ifndef CM_DISABLE
#define CM_DISABLE CM_0
#endif
#ifndef __LDBL_DIG__
#define __LDBL_DIG__ 6
#endif
#ifndef OSCOFF
#define OSCOFF 0x0020
#endif
#ifndef __GNUC_GNU_INLINE__
#define __GNUC_GNU_INLINE__ 1
#endif
#ifndef TACCTL0
#define TACCTL0 TA0CCTL0
#endif
#ifndef TACCTL1
#define TACCTL1 TA0CCTL1
#endif
#ifndef TACCTL2
#define TACCTL2 TA0CCTL2
#endif
#ifndef BTIP0
#define BTIP0 0x01
#endif
#ifndef BTIP1
#define BTIP1 0x02
#endif
#ifndef BTIP2
#define BTIP2 0x04
#endif
#ifndef WDTIS0
#define WDTIS0 0x0001
#endif
#ifndef TIMER1_A1_VECTOR
#define TIMER1_A1_VECTOR 24
#endif
#ifndef CAPD0
#define CAPD0 0x01
#endif
#ifndef CAPD1
#define CAPD1 0x02
#endif
#ifndef CAPD2
#define CAPD2 0x04
#endif
#ifndef CAPD3
#define CAPD3 0x08
#endif
#ifndef CAPD4
#define CAPD4 0x10
#endif
#ifndef CAPD5
#define CAPD5 0x20
#endif
#ifndef CAPD6
#define CAPD6 0x40
#endif
#ifndef CAPD7
#define CAPD7 0x80
#endif
#ifndef C
#define C 0x0001
#endif
#ifndef N
#define N 0x0004
#endif
#ifndef CAPD_
#define CAPD_ 0x005B
#endif
#ifndef V
#define V 0x0100
#endif
#ifndef Z
#define Z 0x0002
#endif
#include "CPU/Variants/Variant.h"
#include "CPU/Variants/VariantManager.h"

class Variant_msp430xW42x : public Variant {
	public:
		Variant_msp430xW42x() {}
		virtual ~Variant_msp430xW42x() {}
		const char *getName() { return "msp430xW42x"; }

		unsigned int getP1DIR() {
#ifdef P1DIR_
			return P1DIR_;
#else
			return 0;
#endif
		}


		unsigned int getP1IE() {
#ifdef P1IE_
			return P1IE_;
#else
			return 0;
#endif
		}


		unsigned int getP1IES() {
#ifdef P1IES_
			return P1IES_;
#else
			return 0;
#endif
		}


		unsigned int getP1IFG() {
#ifdef P1IFG_
			return P1IFG_;
#else
			return 0;
#endif
		}


		unsigned int getP1IN() {
#ifdef P1IN_
			return P1IN_;
#else
			return 0;
#endif
		}


		unsigned int getP1OUT() {
#ifdef P1OUT_
			return P1OUT_;
#else
			return 0;
#endif
		}


		unsigned int getP1REN() {
#ifdef P1REN_
			return P1REN_;
#else
			return 0;
#endif
		}


		unsigned int getP1SEL() {
#ifdef P1SEL_
			return P1SEL_;
#else
			return 0;
#endif
		}


		unsigned int getP2DIR() {
#ifdef P2DIR_
			return P2DIR_;
#else
			return 0;
#endif
		}


		unsigned int getP2IE() {
#ifdef P2IE_
			return P2IE_;
#else
			return 0;
#endif
		}


		unsigned int getP2IES() {
#ifdef P2IES_
			return P2IES_;
#else
			return 0;
#endif
		}


		unsigned int getP2IFG() {
#ifdef P2IFG_
			return P2IFG_;
#else
			return 0;
#endif
		}


		unsigned int getP2IN() {
#ifdef P2IN_
			return P2IN_;
#else
			return 0;
#endif
		}


		unsigned int getP2OUT() {
#ifdef P2OUT_
			return P2OUT_;
#else
			return 0;
#endif
		}


		unsigned int getP2REN() {
#ifdef P2REN_
			return P2REN_;
#else
			return 0;
#endif
		}


		unsigned int getP2SEL() {
#ifdef P2SEL_
			return P2SEL_;
#else
			return 0;
#endif
		}


		unsigned int getP3DIR() {
#ifdef P3DIR_
			return P3DIR_;
#else
			return 0;
#endif
		}


		unsigned int getP3IN() {
#ifdef P3IN_
			return P3IN_;
#else
			return 0;
#endif
		}


		unsigned int getP3OUT() {
#ifdef P3OUT_
			return P3OUT_;
#else
			return 0;
#endif
		}


		unsigned int getP3REN() {
#ifdef P3REN_
			return P3REN_;
#else
			return 0;
#endif
		}


		unsigned int getP3SEL() {
#ifdef P3SEL_
			return P3SEL_;
#else
			return 0;
#endif
		}


		unsigned int getP4DIR() {
#ifdef P4DIR_
			return P4DIR_;
#else
			return 0;
#endif
		}


		unsigned int getP4IN() {
#ifdef P4IN_
			return P4IN_;
#else
			return 0;
#endif
		}


		unsigned int getP4OUT() {
#ifdef P4OUT_
			return P4OUT_;
#else
			return 0;
#endif
		}


		unsigned int getP4REN() {
#ifdef P4REN_
			return P4REN_;
#else
			return 0;
#endif
		}


		unsigned int getP4SEL() {
#ifdef P4SEL_
			return P4SEL_;
#else
			return 0;
#endif
		}


		unsigned int getP5DIR() {
#ifdef P5DIR_
			return P5DIR_;
#else
			return 0;
#endif
		}


		unsigned int getP5IN() {
#ifdef P5IN_
			return P5IN_;
#else
			return 0;
#endif
		}


		unsigned int getP5OUT() {
#ifdef P5OUT_
			return P5OUT_;
#else
			return 0;
#endif
		}


		unsigned int getP5REN() {
#ifdef P5REN_
			return P5REN_;
#else
			return 0;
#endif
		}


		unsigned int getP5SEL() {
#ifdef P5SEL_
			return P5SEL_;
#else
			return 0;
#endif
		}


		unsigned int getP6DIR() {
#ifdef P6DIR_
			return P6DIR_;
#else
			return 0;
#endif
		}


		unsigned int getP6IN() {
#ifdef P6IN_
			return P6IN_;
#else
			return 0;
#endif
		}


